---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetIdIterator.Dispose
source: html/3b659498-23da-879d-011f-d61da8fafa51.htm
---
# Autodesk.Revit.DB.FilteredWorksetIdIterator.Dispose Method

Releases all resources used by the FilteredWorksetIdIterator

## Syntax (C#)
```csharp
public void Dispose()
```